DataProcessors/ЗагрузитьДанныеНаУголь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузитьДанныеНаУголь</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЛьготы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЛьгот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметЛьготы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредметЛьготы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СельскийСовет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СельскиеСоветы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеНаУголь</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРождения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПаспортныеДанные</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИНН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Catalogs/ФизическиеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ФизическиеЛица</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортКемВыдан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизацииВыдающиеДокументы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыПоВидам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПрописка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресФактическогоПроживания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресФактПроживанияИПропискаСовпадают</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаРождения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Страна</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Гражданство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Страна</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписанЭП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Зашифрован</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редактирует</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СельскийСовет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СельскиеСоветы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СемейноеПоложение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СемейноеПоложение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГдеРаботает</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>180</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеФункциональныхОграничений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицоПодОпекой</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СНИЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Студент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставСемьи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Родство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Родство</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Документы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДокументыПоВидам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыдачи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КемВыдан</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОрганизацииВыдающиеДокументы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Паспорт</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЛьготныеКатегории</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛьготныеКатегории</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Учеба</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Образование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>90</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Специальность</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоОбучения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыдачиДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ЗагрузитьДанныеНаУголь/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберете Excel - файл";
	Диалог.ПолноеИмяФайла = "C:\";
	Диалог.Фильтр = "Таблицы (*.xls, *.xlsx)|*.xls; *.xlsx;|Microsoft Excel 97/2000/XP/2003 (*.xls)|*.xls|Microsoft Excel 2007/2010(*.xlsx)|*.xlsx";
	Если Диалог.Выбрать() Тогда
	    Объект.ПутьКФайлу = Диалог.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура  НайтиФИО(ФИО,Адрес,Категория,ДатаРождения,Паспорт,ИНН)
	ФИО_Поиск = Справочники.ФизическиеЛица.НайтиПоНаименованию(ФИО);
	
	Если  ФИО_Поиск.Пустая() Тогда
	     НовыйСправочник = Справочники.ФизическиеЛица.СоздатьЭлемент();
		 НовыйСправочник.Наименование  = ФИО;
		 НовыйСправочник.ИНН = ИНН;
		 НовыйСправочник.АдресФактическогоПроживания = Адрес;
		 НовыйСправочник.АдресПрописка = Адрес;
		 НовыйСправочник.ДатаРождения = ДатаРождения;
		 НоваяСтрокаКатегории = НовыйСправочник.ЛьготныеКатегории.Добавить();
		 ЛьготнаяКатегория = Справочники.ЛьготныеКатегории.НайтиПоНаименованию(Категория);
		 НоваяСтрокаКатегории.Категория =   ЛьготнаяКатегория.Ссылка;
		 НоваяСтрокаПаспорт = НовыйСправочник.Документы.Добавить();
		 ПоискДок = Справочники.ДокументыПоВидам.НайтиПоНаименованию("Паспорт");
		 НоваяСтрокаПаспорт.Наименование = ПоискДок;
		 НоваяСтрокаПаспорт.Серия = Паспорт;
		 НоваяСтрокаПаспорт.Номер = Паспорт;
		 //НоваяСтрокаПаспорт.Паспорт = Истина;
		 НовыйСправочник.СельскийСовет = Объект.СельскийСовет;
		 НовыйСправочник.Записать();
		 Сообщить("Сорздан Справочник "+ НовыйСправочник.Наименование);
	 
	КонецЕсли;
	 
	КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	Объект.ДанныеНаУголь.Очистить();
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		ExcelКнига =Excel.Application.WorkBooks.Open(Объект.ПутьКФайлу);
		ExcelЛист = ExcelКнига.WorkSheets(1);
	Исключение
		//ОбщееНазначение.СообщитьПользователю("Ошибка. Возможно не установлен Excel.");
		Возврат;
	КонецПопытки;
	//vExcel = Лев(Excel.Version,Найти(Excel.Version,".")-1);
	//Если vExcel = "8" Тогда
	    КоличествоСтрок = ExcelЛист.Cells.CurrentRegion.Rows.Count;
		КоличествоКолонок = Макс(ExcelЛист.Cells.CurrentRegion.Columns.Count,13);
	//Иначе	
	//    КоличествоСтрок = ExcelЛист.Cells(1,1).SpecialCells(1,1).Rows.Count;
	//	КоличествоКолонок = ExcelЛист.Cells(1,1).SpecialCells(1,1).Column;
	//КонецЕсли;
	
	Для ТекСтрока = Начать По Закончить Цикл
		Адрес  = СокрЛП(ExcelЛист.Cells(ТекСтрока,3).Value);
		Категория  = СокрЛП(ExcelЛист.Cells(ТекСтрока,4).Value);
		ДатаРождения =  СокрЛП(ExcelЛист.Cells(ТекСтрока,5).Value);
		Паспорт = СокрЛП(ExcelЛист.Cells(ТекСтрока,6).Value);
		ИНН =  СтрЗаменить(СокрЛП(ExcelЛист.Cells(ТекСтрока,7).Value),Символы.НПП,"");
		ФИО = СокрЛП(ExcelЛист.Cells(ТекСтрока,2).Value);
		
		НайтиФИО(ФИО,Адрес,Категория,ДатаРождения,Паспорт,ИНН);
		
		НоваяСтрока = Объект.ДанныеНаУголь.Добавить();
		НоваяСтрока.ФИО   = ФИО;
		НоваяСтрока.Адрес  = Адрес;
		НоваяСтрока.Категория = Категория;
		НоваяСтрока.ДатаРождения = ДатаРождения;
		НоваяСтрока.ПаспортныеДанные = Паспорт;
		НоваяСтрока.ИНН  = ИНН;
		
	
	КонецЦикла;
		
	Excel.Application.Quit();
	Excel = 0;
	
  
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументНаСервере()
	Для каждого ТекСтрока Из Объект.ДанныеНаУголь Цикл
	     Док = Документы.ЛичноеДело.СоздатьДокумент();
		 Если ЗначениеЗаполнено(Объект.ДатаДок) Тогда
		    Док.Дата = Объект.ДатаДок; 
		 Иначе	
		 	Док.Дата = ТекущаяДата();
		 КонецЕсли;
		 
		 Заявитель = Справочники.ФизическиеЛица.НайтиПоНаименованию(ТекСтрока.ФИО);
		 Док.Заявитель = Заявитель;
		 Док.Организация = Объект.Организация;
		 Док.АдресПрописка = Заявитель.АдресПрописка;
		 Док.АдресФактическогоПроживания = Заявитель.АдресФактическогоПроживания;
		 Док.АдресФактПроживанияИПропискаСовпадают = Заявитель.АдресФактПроживанияИПропискаСовпадают;
		 ЛьготнаяКатегория = Справочники.ЛьготныеКатегории.НайтиПоНаименованию(ТекСтрока.Категория);
		 Док.ЛьготнаяКатегория = ЛьготнаяКатегория;
		 Док.Льгота = Истина;
		 НовЛьгота = Док.ВидыЛьготы.Добавить();
		 НовЛьгота.ЛьготнаяКатегория = ЛьготнаяКатегория;
		 НовЛьгота.Наименование =  Объект.ВидЛьготы;
		 НовЛьгота.ПредметЛьготы = Объект.ПредметЛьготы;
		 НовЛьгота.Показатель = 2;
		 Док.Принял = Объект.Сотрудник;
		 Док.СельскийСовет = Объект.СельскийСовет;
		 Док.Записать();
		 		

		 Сообщить("Документ создан "+ Строка(Док))
	
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокумент(Команда)
	СоздатьДокументНаСервере();
КонецПроцедуры
